app/views/users/_form.html.erb


      <% Usertype.all.each do |u| %>
---
SELECT "usertypes".* FROM "usertypes"