app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    #Es lo mismo que decir select * from users se guarda en @users como una especie de lista
    @users = User.all

INSERT INTO "users" ("nombres", "apellidos", "telefonos", "email", "usertype_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "telefonos" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["telefonos", "8282813"], ["updated_at", 2016-07-21 02:15:05 UTC], ["id", 3]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)